In [1]:
import pandas as pd
import numpy as np

In [3]:
a = pd.DataFrame(
    {'AA':[np.NaN,1,2,3],
     'BB':[1,2,np.NaN,4],
     'CC':[4,np.NaN,5,6],
     'DD':[np.NaN,7,8,9]},
    index=['aa','bb','cc','dd']
)
a

     AA   BB   CC   DD
aa  NaN  1.0  4.0  NaN
bb  1.0  2.0  NaN  7.0
cc  2.0  NaN  5.0  8.0
dd  3.0  4.0  6.0  9.0

In [4]:
b = pd.DataFrame(
    {'AA':[np.NaN,1,2,3],
     'BB':[1,2,np.NaN,4],
     'CC':[4,np.NaN,5,6],
     'EE':[np.NaN,7,8,9]},
    index=['aa','bb','ee','dd']
)
b

     AA   BB   CC   EE
aa  NaN  1.0  4.0  NaN
bb  1.0  2.0  NaN  7.0
ee  2.0  NaN  5.0  8.0
dd  3.0  4.0  6.0  9.0

In [8]:
df = a+b #缺失处不参与计算
df

     AA   BB    CC  DD  EE
aa  NaN  2.0   8.0 NaN NaN
bb  2.0  4.0   NaN NaN NaN
cc  NaN  NaN   NaN NaN NaN
dd  6.0  8.0  12.0 NaN NaN
ee  NaN  NaN   NaN NaN NaN

In [9]:
df['AA'].sum()

8.0

In [10]:
df.mean() #缺失值不考虑

AA     4.000000
BB     4.666667
CC    10.000000
DD          NaN
EE          NaN
dtype: float64

In [16]:
df.groupby('CC').mean() #取参数指定列有值的行,并未执行求均值操作

       AA   BB  DD  EE
CC
8.0   NaN  2.0 NaN NaN
12.0  6.0  8.0 NaN NaN

In [20]:
dfc = df.copy()
dfc.fillna(0) #缺失值用0.0填充，

     AA   BB    CC   DD   EE
aa  0.0  2.0   8.0  0.0  0.0
bb  2.0  4.0   0.0  0.0  0.0
cc  0.0  0.0   0.0  0.0  0.0
dd  6.0  8.0  12.0  0.0  0.0
ee  0.0  0.0   0.0  0.0  0.0

In [22]:
dfc['EE'].fillna('e') #对指定列填充

aa    e
bb    e
cc    e
dd    e
ee    e
Name: EE, dtype: object

In [24]:
dfc.fillna(df.mean())

     AA        BB    CC  DD  EE
aa  4.0  2.000000   8.0 NaN NaN
bb  2.0  4.000000  10.0 NaN NaN
cc  4.0  4.666667  10.0 NaN NaN
dd  6.0  8.000000  12.0 NaN NaN
ee  4.0  4.666667  10.0 NaN NaN

In [25]:
dfc #填充并未对其本身做出任何变动

     AA   BB    CC  DD  EE
aa  NaN  2.0   8.0 NaN NaN
bb  2.0  4.0   NaN NaN NaN
cc  NaN  NaN   NaN NaN NaN
dd  6.0  8.0  12.0 NaN NaN
ee  NaN  NaN   NaN NaN NaN

In [28]:
dfc.dropna(axis=1) #将有空值的列丢掉

Empty DataFrame
Columns: []
Index: [aa, bb, cc, dd, ee]

In [30]:
dfc['AA'].dropna(axis=0) #将AA列有空值的行丢掉

bb    2.0
dd    6.0
Name: AA, dtype: float64

In [31]:
dfc.count()

AA    2
BB    3
CC    2
DD    0
EE    0
dtype: int64

In [44]:
df.replace({'AA':np.NaN},1) #值的替换

     AA   BB    CC  DD  EE
aa  1.0  2.0   8.0 NaN NaN
bb  2.0  4.0   NaN NaN NaN
cc  1.0  NaN   NaN NaN NaN
dd  6.0  8.0  12.0 NaN NaN
ee  1.0  NaN   NaN NaN NaN